Repository: Jassy930/FluxDeck
Catalog: apps/desktop-macos-native/FluxDeckNative/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# resource.health.unhealthy
source: Unhealthy
zh_hans: 不健康

# resource.health.unknown
source: Unknown
zh_hans: 未知

# resource.label.auto_start
source: Auto Start
zh_hans: 自动启动

# resource.label.endpoint
source: Endpoint
zh_hans: 端点

# resource.label.last_error
source: Last Error
zh_hans: 最近错误

# resource.label.models
source: Models
zh_hans: 模型

# resource.label.provider
source: Provider
zh_hans: 供应商

# resource.provider.status.disabled
source: DISABLED
zh_hans: 已禁用

# resource.provider.status.enabled
source: ENABLED
zh_hans: 已启用

# resource.provider.toggle.disable
source: Disable
zh_hans: 禁用

# resource.provider.toggle.enable
source: Enable
zh_hans: 启用

# settings.action.apply
source: Apply
zh_hans: 应用

# settings.action.apply_refresh
source: Apply & Refresh
zh_hans: 应用并刷新

# settings.action.reset
source: Reset
zh_hans: 重置

# settings.connection.endpoint
source: Admin API Endpoint
zh_hans: Admin API 地址

# settings.connection.validation.invalid_url
source: Admin URL only supports http/https, for example http://127.0.0.1:7777.
zh_hans: Admin URL 仅支持 http/https，例如 http://127.0.0.1:7777。

# settings.diagnostics.busy
source: Busy
zh_hans: 忙碌

# settings.diagnostics.current_endpoint
source: Current Endpoint
zh_hans: 当前端点

# settings.diagnostics.error
source: Error
zh_hans: 错误

# settings.language.description
source: Choose whether the native shell follows the system language or uses a specific app language.
zh_hans: 选择原生工作台是跟随系统语言，还是使用指定的应用语言。

# settings.language.option.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# settings.language.option.system
source: Follow System
zh_hans: 跟随系统

# settings.language.title
source: Language
zh_hans: 语言

# settings.section.admin_api.description
source: Configure the fluxd Admin API endpoint used by the native shell.
zh_hans: 配置原生壳层使用的 fluxd 管理 API 地址。

# settings.section.admin_api.title
source: Admin API
zh_hans: 管理 API

# settings.section.diagnostics.description
source: Review current endpoint and shell state for troubleshooting.
zh_hans: 查看当前端点与壳层状态以协助排障。

# settings.section.diagnostics.title
source: Diagnostics
zh_hans: 诊断

# settings.section.refresh_sync.description
source: Apply, refresh and reset connection settings without leaving the workbench.
zh_hans: 无需离开工作台即可应用、刷新和重置连接设置。

# settings.section.refresh_sync.title
source: Refresh & Sync
zh_hans: 刷新与同步

# settings.status.needs_attention
source: Needs attention
zh_hans: 需要关注

# settings.status.not_configured
source: Not configured
zh_hans: 未配置

# settings.status.ready
source: Ready
zh_hans: 就绪

# settings.status.refreshing
source: Refreshing
zh_hans: 刷新中

# shell.error.refresh_accessibility
source: Refresh error: %1$@
zh_hans: 刷新错误：%1$@

# shell.error.retry
source: Retry
zh_hans: 重试

# shell.mode.backup
source: Backup
zh_hans: 兜底

# shell.mode.direct
source: Direct
zh_hans: 直连

# shell.mode.global
source: Global
zh_hans: 全局

# shell.mode.rule
source: Rule
zh_hans: 规则

# shell.status.alert_count.one
source: %lld alert
zh_hans: %lld 条告警

# shell.status.alert_count.other
source: %lld alerts
zh_hans: %lld 条告警

# shell.status.connection.connected
source: Connected
zh_hans: 已连接

# shell.status.connection.offline
source: Offline
zh_hans: 离线

# shell.status.connection.syncing
source: Syncing
zh_hans: 同步中

# shell.status.gateway_count.one
source: %lld running
zh_hans: %lld 个运行中

# shell.status.gateway_count.other
source: %lld running
zh_hans: %lld 个运行中

# shell.toolbar.admin
source: Admin
zh_hans: 管理端

# shell.toolbar.last_refresh
source: Last refresh %@
zh_hans: 上次刷新 %@

# shell.toolbar.refresh
source: Refresh
zh_hans: 刷新

# shell.toolbar.workspace
source: Workspace
zh_hans: 工作区

# sidebar.brand.subtitle
source: Control Plane
zh_hans: 控制平面

# sidebar.group.overview
source: Overview
zh_hans: 概览

# sidebar.group.proxy
source: Proxy
zh_hans: 代理

# sidebar.group.system
source: System
zh_hans: 系统

# sidebar.group.visualization
source: Visualization
zh_hans: 可视化

# sidebar.section.connections
source: Connections
zh_hans: 连接

# sidebar.section.gateways
source: Gateways
zh_hans: 网关

# sidebar.section.logs
source: Logs
zh_hans: 日志

# sidebar.section.overview
source: Overview
zh_hans: 概览

# sidebar.section.providers
source: Providers
zh_hans: 供应商

# sidebar.section.route_map
source: Route Map
zh_hans: 路由图

# sidebar.section.settings
source: Settings
zh_hans: 设置

# sidebar.section.topology
source: Topology
zh_hans: 拓扑

# sidebar.section.traffic
source: Traffic
zh_hans: 流量

# topology.columns.entrypoints
source: Entrypoints
zh_hans: 入口点

# topology.columns.gateways
source: Gateways
zh_hans: 网关

# topology.columns.providers
source: Providers
zh_hans: 供应商

# topology.control.flow
source: Flow
zh_hans: 流向

# topology.control.highlight
source: Highlight
zh_hans: 高亮

# topology.control.metric
source: Metric
zh_hans: 指标

# topology.controls.flow
source: Flow
zh_hans: 流向

# topology.controls.highlight
source: Highlight
zh_hans: 高亮

# topology.controls.metric
source: Metric
zh_hans: 指标

# topology.empty.active_routes
source: No active token routes yet.
zh_hans: 当前还没有活跃的令牌路由。

# topology.empty.awaiting_traffic
source: Awaiting traffic to populate topology.
zh_hans: 等待流量后显示拓扑。

# topology.flow.by_model
source: By Model
zh_hans: 按模型

# topology.flow.total_only
source: Total Only
zh_hans: 仅总量

# topology.highlight.all
source: All
zh_hans: 全部

# topology.highlight.top3
source: Top 3
zh_hans: 前 3

# topology.highlight.top5
source: Top 5
zh_hans: 前 5

# topology.hot_path.top_model
source: Top model %1$@
zh_hans: 热门模型 %1$@

# topology.label.total
source: Total
zh_hans: 总计

# topology.metric.cached_short
source: %1$@ cached
zh_hans: %1$@ 缓存

# topology.metric.errors_short
source: %1$@ err
zh_hans: %1$@ 错误

# topology.metric.requests
source: Requests
zh_hans: 请求

# topology.metric.requests_short
source: %1$@ req
zh_hans: %1$@ 请求

# topology.metric.tokens
source: Tokens
zh_hans: 令牌

# topology.metric.tokens_short
source: %1$@ tok
zh_hans: %1$@ 令牌

# topology.node.unknown_provider
source: UNKNOWN PROVIDER
zh_hans: 未知 Provider

# topology.page.subtitle
source: Sankey flow with inline model density and hover diagnostics.
zh_hans: Sankey 流向图，内联展示模型密度与悬停诊断。

# topology.page.title
source: Topology
zh_hans: 拓扑

# topology.summary.hot_paths
source: Hot Paths
zh_hans: 热点路径

# topology.summary.model_mix
source: Model Mix
zh_hans: 模型分布

# topology.tooltip.model
source: Model %1$@
zh_hans: 模型 %1$@

# topology.view.subtitle
source: Sankey flow with inline model density and hover diagnostics.
zh_hans: Sankey 流向图，内联展示模型密度与悬停诊断。

# topology.view.title
source: Topology
zh_hans: 拓扑

# traffic.action.refresh
source: Refresh
zh_hans: 刷新

# traffic.alert.latency_elevated.detail
source: One or more gateways are averaging above 1000 ms.
zh_hans: 一个或多个 Gateway 的平均延迟超过 1000 ms。

# traffic.alert.latency_elevated.title
source: Latency elevated
zh_hans: 延迟升高

# traffic.alert.latest_bucket_idle.detail
source: The most recent trend bucket shows no traffic.
zh_hans: 最近一个趋势时间桶没有流量。

# traffic.alert.latest_bucket_idle.title
source: Latest bucket is idle
zh_hans: 最新时间桶空闲

# traffic.alert.no_traffic.detail
source: No requests were recorded in the selected period.
zh_hans: 所选时间段内没有任何请求。

# traffic.alert.no_traffic.title
source: No traffic yet
zh_hans: 暂无流量

# traffic.alert.overview_missing.detail
source: Trend points are available but overview statistics are missing.
zh_hans: 趋势点已返回，但概览统计缺失。

# traffic.alert.overview_missing.title
source: No overview data
zh_hans: 缺少概览数据

# traffic.alert.request_errors.detail
source: %lld requests failed in the selected period.
zh_hans: 所选时间段内有 %lld 个请求失败。

# traffic.alert.request_errors.title
source: Request errors detected
zh_hans: 检测到请求错误

# traffic.breakdown.empty
source: No dimension data in this period.
zh_hans: 此时间段暂无维度数据。

# traffic.breakdown.errors_value
source: %lld errors
zh_hans: %lld 错误

# traffic.breakdown.gateway
source: By Gateway
zh_hans: 按网关

# traffic.breakdown.model
source: By Model
zh_hans: 按模型

# traffic.breakdown.provider
source: By Provider
zh_hans: 按供应商

# traffic.breakdown.requests_value
source: %lld req
zh_hans: %lld 请求

# traffic.empty.message
source: Once gateways start serving requests, this page will show throughput, latency, token usage and error alerts.
zh_hans: 网关开始处理请求后，此页将显示吞吐、延迟、令牌使用与错误告警。

# traffic.empty.period
source: No traffic recorded for %@.
zh_hans: %@ 时间段暂无流量。

# traffic.error.load_failed
source: Failed to load traffic monitor
zh_hans: 加载流量监控失败

# traffic.header.updated
source: Updated %@
zh_hans: %@ 已更新

# traffic.kpi.avg_latency
source: Avg Latency
zh_hans: 平均延迟

# traffic.kpi.cached
source: Cached
zh_hans: 缓存

# traffic.kpi.input
source: Input
zh_hans: 输入

# traffic.kpi.no_detail
source: No detail in this period
zh_hans: 此时间段暂无明细

# traffic.kpi.output
source: Output
zh_hans: 输出

# traffic.kpi.requests_per_min
source: Requests / min
zh_hans: 每分钟请求

# traffic.kpi.success_detail
source: %1$lld ok / %2$lld err
zh_hans: %1$lld 成功 / %2$lld 错误

# traffic.kpi.success_rate
source: Success Rate
zh_hans: 成功率

# traffic.kpi.total_tokens
source: Total Tokens
zh_hans: 总令牌

# traffic.label.other
source: Other
zh_hans: 其他

# traffic.label.other_model
source: Other (model)
zh_hans: 其他（模型）

# traffic.page.subtitle
source: Live request throughput, latency and failure distribution.
zh_hans: 实时请求吞吐、延迟与失败分布。

# traffic.page.title
source: Traffic Monitor
zh_hans: 流量监控

# traffic.routing.none.gateway
source: No gateway
zh_hans: 无 Gateway

# traffic.routing.none.model
source: No model
zh_hans: 无模型

# traffic.routing.none.provider
source: No provider
zh_hans: 无 Provider

# traffic.routing.top_gateway
source: Top Gateway: %@
zh_hans: 头部网关：%@

# traffic.routing.top_model
source: Top Model: %@
zh_hans: 头部模型：%@

# traffic.routing.top_provider
source: Top Provider: %@
zh_hans: 头部供应商：%@

# traffic.section.alerts
source: Alerts
zh_hans: 告警

# traffic.section.routing_summary
source: Routing Summary
zh_hans: 路由概览

# traffic.section.token_trend
source: Token Trend by Model
zh_hans: 按模型的令牌趋势

# traffic.section.token_trend.empty
source: No trend buckets available for %@.
zh_hans: %@ 时间段暂无趋势数据。

# traffic.state.loading
source: Loading real-time traffic statistics...
zh_hans: 正在加载实时流量统计...

# traffic.summary.no_model
source: No model
zh_hans: 无模型

# traffic.summary.peak_bucket_errors
source: Peak Bucket Errors
zh_hans: 峰值时间桶错误数

# traffic.summary.peak_total_tokens
source: Peak Total Tokens
zh_hans: 峰值总令牌

# traffic.summary.top_model_share
source: Top Model Share
zh_hans: 头部模型占比

# traffic.tooltip.errors
source: %lld err
zh_hans: %lld 错误

# traffic.tooltip.token_mix
source: I %1$@ O %2$@ C %3$@
zh_hans: 输入 %1$@ 输出 %2$@ 缓存 %3$@

# traffic.tooltip.total_tokens
source: Total Tokens
zh_hans: 总令牌

# traffic.trend.legend.total_tokens
source: Total Tokens
zh_hans: 总令牌
